# Ο παρακάτω τύπος μπορεί να χρησιμοποιηθεί για τον προσδιορισμό της απόσταστης
# κατά τη οποία πέφτει ένα αντικέιμενο λόγω της βαρύτητας, σε συγκεκριμένο
# χρόνο, ξεκινώντας από σταση:   d = 1/2*g*t^2
# d = απόσταση σε μέτρα, g = 9.8, t = ο χρόνος που διαρκεί η πτώση του
# αντικειμένου σε δευτερόλεπτα.
g = 9.8


def ektelesi():
    falling_distance()


def falling_distance():
    y = 0
    for x in range(1, 10 + 1):
        defterolepta = int(input('Δώσε το χρόνο πτώσης ενός αντικειμένου σε '
                                 'δευτερόλεπτα: '))
        print()
        t = defterolepta
        seconds = float((1 / 2) * g * (t ** 2))
        y = y + 1
        print(y)
        print('Η απόσταση των δευτερολέπτων σε μέτρα είναι: ',
              format(seconds, ',.2f'), sep='')
        print()


ektelesi()
