# 1η θέση = 20€ , 2η θέση = 15€ και 3η θέση = 10€


def ektelesi():
    ticket_issues = 'Y'
    income = 0
    pos_1 = 0  # Θα χρησιμοποιηθεί για την καταμέτρηση των εισιτηρίων, 1ηςΘΕΣΗΣ
    pos_2 = 0  # Θα χρησιμοποιηθεί για την καταμέτρηση των εισιτηρίων, 2ηςΘΕΣΗΣ
    pos_3 = 0  # Θα χρησιμοποιηθεί για την καταμέτρηση των εισιτηρίων, 3ηςΘΕΣΗΣ

    # Εδώ το πρόγραμμα θα επαναλαμβάνετε για οσο η τιμή είναι διάφορη του 'Ν'
    while ticket_issues != 'N':
        emfanisi_katigorion()
        categorie_position = katigoria_thesis()

        # Εδώ παίρνει τις τιμές από την εντολή return, της συνάρτησης της
        # timi thesis και τις μεταφέρει στις μεταβλητές παρακάτω
        position_price, p1, p2, p3 = timi_thesis(categorie_position)
        pos_1 = int(pos_1 + p1)  # Εδώ κάνει την καταμέτρηση 1ης ΘΕΣΗΣ
        pos_2 = int(pos_2 + p2)  # Εδώ κάνει την καταμέτρηση 2ης ΘΕΣΗΣ
        pos_3 = int(pos_3 + p3)  # Εδώ κάνει την καταμέτρηση 3ης ΘΕΣΗΣ

        # Σε αυτό το σημείο υπολογίζει το εισ΄΄οδημα.
        income = float(income + position_price)

        # Σε αυτό το σημείο εμφανίζει τα αποτελέσματα.
        print('Εισιτήρια που πουλήθηκαν:\n1η ΘΕΣΗ = ', pos_1, '\n2η ΘΕΣΗ = ',
              pos_2, '\n3η ΘΕΣΗ = ', pos_3, sep='')
        print()
        print('Το εισόδημα που προέκυψε από την πώληση των εισιτηρίων '
              'είναι: €', format(income, ',.2f'), sep='')
        print()
        ticket_issues = ekdosi_eisitirion()  # Σε αυτο το σημείο κάνει loop


def katigoria_thesis():
    # Η συνάρτηση αυτή θα χρησιμοποιηθεί για την εισαγωγή της θέσης στην οποία
    # θα κοπεί το εισιτήριο, αλλά και για την επαλήθευση σε περίπτωση
    # λανθασμένης απάντησης από τον χρήστη.
    thesi = int(input('Δώσε την κατηγορία της θέσης στην οποία θα κοπεί το '
                      'εισιτήριο: '))
    print()
    # Εδώ γ΄΄ινεται η επαλήθευση σε περίπτωση λανθασμένης απάντησης
    while thesi != 1 and thesi != 2 and thesi != 3:
        print('Έχεις δώσει λανθασμένη κατηγορία θέσης. Οι κατηγορίες θέσεων '
              'είναι 1, 2 και 3.')
        thesi = int(input('Παρακαλώ ξανά προσπάθησε: '))
        print()

    return thesi


def ekdosi_eisitirion():
    # Η συνάρτηση αυτή θα χρησιμοποιηθεί για την επαναληπτική εκτέλεση του
    # προγράμματος, αλλά και για την επαλήθευση σε περίπτωση λανθασμένης
    # απάντησης από τον χρήστη.
    ekdosi = input('ΠΡΟΣΟΧΗ!!!\n(Τα γράμματα πρέπει να είναι σε '
                   'λατινικούς χαρακτήρες και κεφαλαία για να συνεχίσει το '
                   'πρόγραμμα.)'
                   '\nΘέλεις να κόψεις άλλο εισιτήριο;\nΔώσε "Y" για ΝΑΙ και '
                   '"N" για ΟΧΙ. : ')
    print()
    # Εδώ γ΄΄ινεται η επαλήθευση σε περίπτωση λανθασμένης απάντησης
    while ekdosi != 'Y' and ekdosi != 'N':
        print('Έχεις δώσει λανθασμένη απάντηση.')
        ekdosi = input('Παρακαλώ ξανά προσπάθησε: ')
        print()

    return ekdosi


def emfanisi_katigorion():
    # Εμφανίζει τις κατηγορίες στην αρχή αλλά και στην επανάληψη του
    # προγράμματος.
    print('\t3 ΚΑΤΗΓΟΡΙΕΣ ΘΕΣΕΩΝ', '\n-------------------------------------')
    print('1η ΘΕΣΗ\t| 2η ΘΕΣΗ\t| 3η ΘΕΣΗ')
    print('20€', '\t| ', '15€', '\t', '\t|   10€')
    print()


def timi_thesis(categorie_position):  # Εδώ βρίσκει την τιμή της θέσης

    # Τις μεταβλητές αυτές τις βάζω, διότι η if-elif-else θα δώσει μια
    # τιμή στην εκάστοτε μεταβλητή και άρα η εντολή return, θa πρέπει να πάρει
    # από κάπου τις τιμές για τις άλλες δύο μεταβλητές, αλλιώς θα βγάλει σφάλμα
    # το πρόγραμμα.
    t1 = 0
    t2 = 0
    t3 = 0
    if categorie_position == 1:
        timi = 20
        t1 = 1
    elif categorie_position == 2:
        timi = 15
        t2 = 1
    else:
        timi = 10
        t3 = 1

    return timi, t1, t2, t3


ektelesi()
